A series is one dimensional array like object that can hold any data type.
It is similar to a column in a table.

In [4]:
import pandas as pd

# Creating a series

data = (1,2,3,4,5)

series = pd.Series(data)

print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#creating a series using dictionary

dictn = {'a': 1, 'b': 2, 'c': 3}

series_dict = pd.Series(dictn)

print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
#medhod 3

data = [1,2,3,4]
ind = ["a","b","c","d"]

series_3 = pd.Series(data, index=ind)

print(series_3)

a    1
b    2
c    3
d    4
dtype: int64

Dataframes

In [8]:
data = {
    "Name" : ['Satyam','Shivam','Sundaram'],
    "City" : ['New Yory','London','Bihta'],
    "Age" : [42,43,24]
}

df = pd.DataFrame(data)

print(df)

       Name      City  Age
0    Satyam  New Yory   42
1    Shivam    London   43
2  Sundaram     Bihta   24

In [61]:
# Creating DataFrames from Dictionary

data = [
    {'Name':'Satyam','Age': 16,'City':'Delhi'},
    {'Name':'Shivam','Age': 18,'City':'Patna'},
    {'Name':'Sundaram','Age': 24,'City':'Bihta'}
]

df = pd.DataFrame(data)

print(df)

       Name  Age   City
0    Satyam   16  Delhi
1    Shivam   18  Patna
2  Sundaram   24  Bihta

In [22]:
df.iloc[0][2]

C:\Users\satya\AppData\Local\Temp\ipykernel_2300\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Delhi'

In [62]:
#Accessing a specific element

df.at[2,"Name"]

'Sundaram'

In [63]:
df.iat[2,2]

'Bihta'

Data manipulation with DataFrame

In [64]:
df

       Name  Age   City
0    Satyam   16  Delhi
1    Shivam   18  Patna
2  Sundaram   24  Bihta

In [65]:
#we have to add a new column

df["Salary"] = [10000,20000,30000]

df

       Name  Age   City  Salary
0    Satyam   16  Delhi   10000
1    Shivam   18  Patna   20000
2  Sundaram   24  Bihta   30000

In [66]:
#Removing a column

df.drop('Salary', axis = 1, inplace = True)
df

       Name  Age   City
0    Satyam   16  Delhi
1    Shivam   18  Patna
2  Sundaram   24  Bihta

In [67]:
#Adding in elements

df["Age"] = df["Age"] +1

df

       Name  Age   City
0    Satyam   17  Delhi
1    Shivam   19  Patna
2  Sundaram   25  Bihta

In [68]:
df.drop(0, inplace = True)
df

       Name  Age   City
1    Shivam   19  Patna
2  Sundaram   25  Bihta

In [69]:
df.describe()

             Age
count   2.000000
mean   22.000000
std     4.242641
min    19.000000
25%    20.500000
50%    22.000000
75%    23.500000
max    25.000000